[NoCoverage] BlockStatement
src/coverage/lcov-report/index.html:108:41
             </div>
         <script src="prettify.js"></script>
         <script>
-            window.onload = function () {
-                prettyPrint();
-            };
+            window.onload = function () {};
         </script>
         <script src="sorter.js"></script>
