[Killed] ConditionalExpression
src/transcriptManager.ts:93:52
 //
 export function getGrade(studentID: StudentID, course: Course): number {
   const theTranscript = allTranscripts.find(t => t.student.studentID == studentID);
-  const theGrade = theTranscript?.grades.find(g => g.course == course);
+  const theGrade = theTranscript?.grades.find(g => true);
   if (theGrade === undefined) {
     throw new Error(`no grade for student ${studentID} in course ${course}`);
killedBy: TranscriptManager getGrade Should fail to get grade for a student that does not exist
statusReason: Error: expect(received).toThrowError()

Received function did not throw

[Killed] EqualityOperator
src/transcriptManager.ts:94:7
 export function getGrade(studentID: StudentID, course: Course): number {
   const theTranscript = allTranscripts.find(t => t.student.studentID == studentID);
   const theGrade = theTranscript?.grades.find(g => g.course == course);
-  if (theGrade === undefined) {
+  if (theGrade !== undefined) {
     throw new Error(`no grade for student ${studentID} in course ${course}`);
   }
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: Error: no grade for student 1 in course test course

[Killed] ConditionalExpression
src/transcriptManager.ts:94:7
 export function getGrade(studentID: StudentID, course: Course): number {
   const theTranscript = allTranscripts.find(t => t.student.studentID == studentID);
   const theGrade = theTranscript?.grades.find(g => g.course == course);
-  if (theGrade === undefined) {
+  if (true) {
     throw new Error(`no grade for student ${studentID} in course ${course}`);
   }
killedBy: TranscriptManager Adding grades should add the grade to the transcript
statusReason: Error: no grade for student 1 in course test course
